# ''  list sort index for in if
 # Написать программу, которая преобразует все буквы (русские) в введенной пользователем строке в числа, соответствующие позиции этих букв в алфавите.
# Пример:
# Ввод: "а%бв42гд!"
# Вывод: "1%234245!"
# rus_alpha = 'ёйцукенгшщзхъфывапролджэячсмитьбю'
# rus_alpha = list(rus_alpha)
# rus_alpha.sort()
# print(rus_alpha)
rus_alpha = ['а', 'б', 'в', 'г', 'д', 'е','ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у',
         'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
a = input()
b = ''
for i in a:
    if i in rus_alpha:
        b += str(rus_alpha.index(i) + 1)
    else:
        b += i
print(b)
