# Написать программу, которая выводит, какие элементы и сколько раз встретились в введённой пользователем строке.
# Пример:
# Ввод: "рьппвьь"
# Вывод: {"р": 1, "ь": 3, "п": 2, "в": 1}
a = {}
for i in input():
    if i in a:
        a[i] += 1  # a[i] = a[i] + 1
    else:
        a[i] = 1
print(a)



