a = 'КОЛОБОК ПОВЕСИЛСЯ!!!'
# .index() - возвращает индекс первого вхождения подстроки.если подстроки нет - возвращает ошибку.
print(a.index(''))
# .find() - возвращает индекс первого вхождения подстроки.если подстроки нет - возвращает -1
print(a.find('нерол'))
print(bool(-2))
# .
print(a.rfind('О'))
# .split(x) - возвращает список из подстрок,образованных разделением строки по подстроке x.по умолчанию x == ' '
print(a.split('О'))
print(a.split(''))
# f.join(q) - возвращает строку , образованную соединением элементов списка q по строке f
print(' 1 '.join(['РЛП ', 'АВРВР', 'ЛВШШМВР']))
#
print(a.capitalize(), a)
