# # ТИПЫ ДАННЫХ:
# # int, float, bool, str
# # ФУНКЦИИ:
# #print()
# input() - считывает данные из консоли, которые возвращает в виде str
# type()-возвращает тип данных аргумента
# list()
# help()
# len()
# range()
print(type('700'))
# Коллекция:
# кортеж tuple() () - неизменяемые, использует разные типы данных,данные упорядочены и проиндексированы
# списки list() []- изменяемые, используют разные типы данных, данные упорядочены и проиндексированы
# множество set() {}- изменяемые, используют разные типы данных, данные не повторяются и не упорядочены
# чтобы создать пустое множество, обезавтельно используем функцию set()
# i = set() - пустое множество
# print(type(set()))
print(type({}))